Scoring guide (Rubric) - Cardio Good Fitness
Criteria	Points
- **Understanding the structure of the data**
Overview of the dataset shape, datatypes - Statistical summary and check for missing values
2
- **Univariate Data Analysis**
Analysis of spread and distribution of every feature in the dataset.
8
- **Multivariate Data Analysis**
Analysis of interaction between features, in the dataset
10
- **Quality & Use of visualisations**
The details in Visualization used.
6
- **Conclusion and Recommendations**
Conclude with the key insights/observations
10
- **Well commented Python Code**
Structure and flow - Well commented code
4
Points	40
Submit Assignment

1. Step import all necessary libraries for statistical analysis, and visualization

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
%matplotlib inline

2. Read the data (from csv file) as dataframe by using read_csv from pandas library

In [2]:
filename = 'CardioGoodFitness.csv'
df = pd.read_csv(filename)

3. Understand structure of the data.

In [3]:
df.head()

  Product  Age  Gender  Education MaritalStatus  Usage  Fitness  Income  Miles
0   TM195   18    Male         14        Single      3        4   29562    112
1   TM195   19    Male         15        Single      2        3   31836     75
2   TM195   19  Female         14     Partnered      4        3   30699     66
3   TM195   19    Male         12        Single      3        3   32973     85
4   TM195   20    Male         13     Partnered      4        2   35247     47

In [5]:
df.tail()

,Product,Age,Gender,Education,MaritalStatus,Usage,Fitness,Income,Miles
175,TM798,40,Male,21,Single,6,5,83416,200
176,TM798,42,Male,18,Single,5,4,89641,200
177,TM798,45,Male,16,Single,5,5,90886,160
178,TM798,47,Male,18,Partnered,4,5,104581,120
179,TM798,48,Male,18,Partnered,4,5,95508,180

In [17]:
print(df.columns)
print("="*75)
print("Number of columns in the dataframe: " + str(len(df.columns)))
print("="*75)

Index(['Product', 'Age', 'Gender', 'Education', 'MaritalStatus', 'Usage',
       'Fitness', 'Income', 'Miles'],
      dtype='object')
===========================================================================
Number of columns in the dataframe: 9
===========================================================================

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 180 entries, 0 to 179
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Product        180 non-null    object
 1   Age            180 non-null    int64
 2   Gender         180 non-null    object
 3   Education      180 non-null    int64
 4   MaritalStatus  180 non-null    object
 5   Usage          180 non-null    int64
 6   Fitness        180 non-null    int64
 7   Income         180 non-null    int64
 8   Miles          180 non-null    int64
dtypes: int64(6), object(3)
memory usage: 12.8+ KB

### Insights
- As it can be seen
There are 3 Categorical variables (including product, Gender and MaritalStatus) and 6 numerical variables.
- There are 180 instances.
- There are 9 columns.

Step 4. Statistical Analysis

In [23]:
numeric_columns = ['Age', 'Education', 'Usage', 'Fitness', 'Income', 'Miles']
df[numeric_columns].describe().T

,count,mean,std,min,25%,50%,75%,max
Age,180.0,28.788889,6.943498,18.0,24.00,26.0,33.00,50.0
Education,180.0,15.572222,1.617055,12.0,14.00,16.0,16.00,21.0
Usage,180.0,3.455556,1.084797,2.0,3.00,3.0,4.00,7.0
Fitness,180.0,3.311111,0.958869,1.0,3.00,3.0,4.00,5.0
Income,180.0,53719.577778,16506.684226,29562.0,44058.75,50596.5,58668.00,104581.0
Miles,180.0,103.194444,51.863605,21.0,66.00,94.0,114.75,360.0

Analysis
1. There some age values that are greater than 33 which is the Q3 of the data.
2. Income variable may need further exploration.

Step 5. Univariate Data Analysis
-